In [1]:
import pandas as pd
import numpy as np

# Q) Let’s say you’re working in HR at a major tech company, and they ask you to find employees with a high probability of leaving the company. They tell you these employees perform well but have the lowest pay.

Given two tables, employees and projects, find the five lowest-paid employees who have completed at least three projects.

Note: We consider projects to be completed when they have an end date, which is the same as saying their End_dt is not NULL.

In [173]:
import pandas as pd

# Create the Employees table as a DataFrame
employees = pd.DataFrame({
    "Emp_ID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "Name": ["Alice", "Bob", "Charlie", "Diana", "Ethan", "Fiona", "George", "Helen", "Ian", "Jane"],
    "Department": ["Engineering", "Engineering", "HR", "Engineering", "Sales", "Engineering", "HR", "Engineering", "Sales", "Engineering"],
    "Salary": [70000, 55000, 45000, 48000, 52000, 76000, 47000, 51000, 44000, 57000],
    "Performance_Rating": [4.5, 4.2, 4.1, 4.3, 4.0, 4.7, 4.0, 4.4, 4.1, 4.6],
    "Join_Date": ["2020-05-01", "2019-03-15", "2018-07-10", "2021-11-05", "2020-02-20", "2017-08-14", "2019-01-25", "2020-06-30", "2021-09-12", "2020-10-18"]
})

# Create the Projects table as a DataFrame
projects = pd.DataFrame({
    "Project_ID": [201, 202, 203, 204, 205, 206, 207, 208, 209, 210, 211, 212, 213, 214, 215, 216, 217, 218, 219],
    "Emp_ID": [101, 102, 103, 104, 105, 106, 107, 108, 101, 102, 102, 104, 101, 105, 106, 108, 110, 110, 110],
    "Start_dt": ["2023-01-01", "2022-07-01", "2022-01-10", "2023-05-01", "2023-04-01", "2023-01-15", "2022-09-01", 
                 "2023-02-01", "2022-06-01", "2023-03-01", "2022-02-01", "2022-07-01", "2023-07-01", "2023-05-01", 
                 "2023-06-01", "2022-01-01", "2023-04-01", "2023-06-01", "2023-08-15"],
    "End_dt": ["2023-03-01", "2022-09-01", "2022-05-15", None, "2023-06-01", "2023-04-15", None, "2023-03-30", 
               "2022-09-01", "2023-06-01", "2022-05-01", "2022-11-01", "2023-09-01", "2023-07-01", "2023-08-01", 
               "2022-03-01", "2023-06-01", "2023-08-01", None],
    "Project_Name": ["Project Alpha", "Project Beta", "Project Gamma", "Project Delta", "Project Epsilon", 
                     "Project Zeta", "Project Eta", "Project Theta", "Project Iota", "Project Kappa", 
                     "Project Lambda", "Project Mu", "Project Nu", "Project Xi", "Project Omicron", 
                     "Project Pi", "Project Rho", "Project Sigma", "Project Tau"]
})

# Display the DataFrames
print("Employees Table:")
print(employees)

print("\nProjects Table:")
print(projects)

Employees Table:
   Emp_ID     Name   Department  Salary  Performance_Rating   Join_Date
0     101    Alice  Engineering   70000                 4.5  2020-05-01
1     102      Bob  Engineering   55000                 4.2  2019-03-15
2     103  Charlie           HR   45000                 4.1  2018-07-10
3     104    Diana  Engineering   48000                 4.3  2021-11-05
4     105    Ethan        Sales   52000                 4.0  2020-02-20
5     106    Fiona  Engineering   76000                 4.7  2017-08-14
6     107   George           HR   47000                 4.0  2019-01-25
7     108    Helen  Engineering   51000                 4.4  2020-06-30
8     109      Ian        Sales   44000                 4.1  2021-09-12
9     110     Jane  Engineering   57000                 4.6  2020-10-18

Projects Table:
    Project_ID  Emp_ID    Start_dt      End_dt     Project_Name
0          201     101  2023-01-01  2023-03-01    Project Alpha
1          202     102  2022-07-01  2022-09-01     Project Beta
2          203     103  2022-01-10  2022-05-15    Project Gamma
3          204     104  2023-05-01        None    Project Delta
4          205     105  2023-04-01  2023-06-01  Project Epsilon
5          206     106  2023-01-15  2023-04-15     Project Zeta
6          207     107  2022-09-01        None      Project Eta
7          208     108  2023-02-01  2023-03-30    Project Theta
8          209     101  2022-06-01  2022-09-01     Project Iota
9          210     102  2023-03-01  2023-06-01    Project Kappa
10         211     102  2022-02-01  2022-05-01   Project Lambda
11         212     104  2022-07-01  2022-11-01       Project Mu
12         213     101  2023-07-01  2023-09-01       Project Nu
13         214     105  2023-05-01  2023-07-01       Project Xi
14         215     106  2023-06-01  2023-08-01  Project Omicron
15         216     108  2022-01-01  2022-03-01       Project Pi
16         217     110  2023-04-01  2023-06-01      Project Rho
17         218     110  2023-06-01  2023-08-01    Project Sigma
18         219     110  2023-08-15        None      Project Tau

# Selecting a column where the value is NON NULL

In [ ]:
p = projects[projects["End_dt"].notnull()]

# Group by Statement; Count(Project_ID)

In [35]:
p = p.groupby("Emp_ID")["Project_ID"].count().reset_index(name="count_Project_ID")

# Filtering for a column that has value greater than 2

In [36]:
p=p[p['count_Project_ID']>2]

# Inner join in SQL

In [37]:
ij = pd.merge(p, employees, on="Emp_ID", how="inner")

# Selecting multiple columns in SQL

In [31]:
ij[["Emp_ID","Salary","Join_Date"]]

   Emp_ID  Salary   Join_Date
0     101   70000  2020-05-01
1     102   55000  2019-03-15

# Dense_rank in SQL

In [42]:
ij['dense_rank']=ij['Salary'].rank(method='dense', ascending=False)

In [45]:
ij[ij['dense_rank']<6]

,Emp_ID,count_Project_ID,Name,Department,Salary,Performance_Rating,Join_Date,dense_rank
0,101,3,Alice,Engineering,70000,4.5,2020-05-01,1.0
1,102,3,Bob,Engineering,55000,4.2,2019-03-15,2.0

In [63]:
def lp_hp (a,b):
    p = b[b["End_dt"].notnull()]
    p = p.groupby("Emp_ID")["Project_ID"].count().reset_index(name="count_Project_ID")
    p=p[p['count_Project_ID']>2]
    ij = pd.merge(p, a, on="Emp_ID", how="inner")
    ij['dense_rank']=ij['Salary'].rank(method='dense', ascending=False)
    ij=ij[ij['dense_rank']<6]
    return(ij)

In [64]:
lp_hp(employees,projects)

,Emp_ID,count_Project_ID,Name,Department,Salary,Performance_Rating,Join_Date,dense_rank
0,101,3,Alice,Engineering,70000,4.5,2020-05-01,1.0
1,102,3,Bob,Engineering,55000,4.2,2019-03-15,2.0

# Q) You’re given a dataframe of students named students_df:

students_df table

name	age	favorite_color	grade
Tim Voss	19	red	91
Nicole Johnson	20	yellow	95
Elsa Williams	21	green	82
John James	20	blue	75
Catherine Jones	23	green	93
Write a function named grades_colors to select only the rows where the student’s favorite color is green or red and their grade is above 90.

In [67]:


students = {"name" : ["Tim Voss", "Nicole Johnson", "Elsa Williams", "John James", "Catherine Jones"], "age" : [19, 20, 21, 20, 23], "favorite_color" : ["red", "yellow", "green", "blue", "green"], "grade" : [91, 95, 82, 75, 93]}

students_df = pd.DataFrame(students)

In [81]:
students_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
1   Nicole Johnson   20         yellow     95
2    Elsa Williams   21          green     82
3       John James   20           blue     75
4  Catherine Jones   23          green     93

In [83]:
# Filtering the DataFrame
filtered_df = students_df[(students_df['grade'] > 90) & 
                          (students_df['favorite_color'].isin(['green', 'red']))]
filtered_df

              name  age favorite_color  grade
0         Tim Voss   19            red     91
4  Catherine Jones   23          green     93

# Q) Write a query to show the number of users, number of transactions placed, and total order amount per month in the year 2020. Assume that we are only interested in the monthly reports for a single year (January-December).

Input:

transactions table

Column	Type
id	INTEGER
user_id	INTEGER
created_at	DATETIME
product_id	INTEGER
quantity	INTEGER
products table

Column	Type
id	INTEGER
name	VARCHAR
price	FLOAT
users table

Column	Type
id	INTEGER
name	VARCHAR
sex	VARCHAR

In [106]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Generate users data
num_users = 50
user_ids = np.arange(1, num_users + 1)
names = ['User_' + str(i) for i in range(1, num_users + 1)]
sexes = np.random.choice(['M', 'F'], size=num_users)
users_df = pd.DataFrame({'id': user_ids, 'name': names, 'sex': sexes})

# Generate products data
num_products = 20
product_ids = np.arange(1, num_products + 1)
names = ['Product_' + str(i) for i in range(1, num_products + 1)]
prices = np.random.uniform(5, 100, size=num_products)  # Prices between 5 and 100
products_df = pd.DataFrame({'id': product_ids, 'name': names, 'price': prices})

# Generate transactions data
num_transactions = 300
start_date = datetime(2019, 1, 1)
end_date = datetime(2021, 12, 31)
date_range = pd.date_range(start_date, end_date)
transactions_df = pd.DataFrame({
    'id': np.arange(1, num_transactions + 1),
    'user_id': np.random.choice(user_ids, size=num_transactions),
    'created_at': np.random.choice(date_range, size=num_transactions),
    'product_id': np.random.choice(product_ids, size=num_transactions),
    'quantity': np.random.randint(1, 5, size=num_transactions)  # Quantity between 1 and 4
})

print("Users DataFrame:")
print(users_df.head())

print("\nProducts DataFrame:")
print(products_df.head())

print("\nTransactions DataFrame:")
print(transactions_df.head())

Users DataFrame:
   id    name sex
0   1  User_1   M
1   2  User_2   M
2   3  User_3   M
3   4  User_4   F
4   5  User_5   F

Products DataFrame:
   id       name      price
0   1  Product_1  82.277946
1   2  Product_2  98.309911
2   3  Product_3  30.440859
3   4  Product_4  45.649737
4   5  Product_5  36.609370

Transactions DataFrame:
   id  user_id created_at  product_id  quantity
0   1       26 2020-09-12          11         1
1   2        6 2021-05-19          14         3
2   3        4 2019-10-13          10         4
3   4       15 2019-02-13          13         2
4   5       38 2021-02-07           3         3

# Left join with different column names
# Filtering on AN YEAR from date column

In [123]:
r = pd.merge(users_df,transactions_df,left_on='id', right_on='user_id', how= 'right')[['user_id','created_at',
                                                                                      'quantity','product_id']]
r = pd.merge(r,products_df,left_on='product_id', right_on='id', how= 'left')[['user_id','created_at',
                                                                                      'quantity','product_id','price']]
r= r[r['created_at'].dt.year == 2020]
r

     user_id created_at  quantity  product_id      price
0         26 2020-09-12         1          11  82.326291
5         43 2020-08-03         4          17  84.412878
10        21 2020-09-18         1           7  66.573131
13        29 2020-03-01         1           6  94.761264
14        40 2020-09-30         4          18  65.269215
..       ...        ...       ...         ...        ...
283        6 2020-07-22         4          18  65.269215
284       10 2020-11-18         2          20  17.244539
285       42 2020-11-24         3           3  30.440859
287       23 2020-03-01         1           5  36.609370
293       36 2020-05-18         1           5  36.609370

[99 rows x 5 columns]

# Group by a field and yield multiple aggregate functions

In [126]:
r.groupby(r['created_at'].dt.month).agg(
        num_users=('user_id', 'nunique'),
        total_quantity=('quantity', 'sum'),
        avg_price=('price', 'mean')).reset_index()

r = r.rename(columns={'created_at': 'Month'})
r

     user_id      Month  quantity  product_id      price
0         26 2020-09-12         1          11  82.326291
5         43 2020-08-03         4          17  84.412878
10        21 2020-09-18         1           7  66.573131
13        29 2020-03-01         1           6  94.761264
14        40 2020-09-30         4          18  65.269215
..       ...        ...       ...         ...        ...
283        6 2020-07-22         4          18  65.269215
284       10 2020-11-18         2          20  17.244539
285       42 2020-11-24         3           3  30.440859
287       23 2020-03-01         1           5  36.609370
293       36 2020-05-18         1           5  36.609370

[99 rows x 5 columns]

# Asking the user for the input

In [154]:
def is_divisible_by_3():
    """Asks the user for a number and checks if it's divisible by 3.
  """

try:
    num = int(input("Enter a number: "))
    if num % 3 == 0:
        print(f"{num} is divisible by 3")
    else:
        print(f"{num} is not divisible by 3")
except ValueError:
    print(int(num))

is_divisible_by_3()

Enter a number: 6
6 is divisible by 3

# Q) We’re given a table of product purchases. Each row in the table represents an individual user product purchase.

Write a query to get the number of customers that were upsold, or in other words, the number of users who bought additional products after their first purchase.

Note: If the customer purchased two things on the same day, that does not count as an upsell, as they were purchased within a similar timeframe.

In [155]:
import pandas as pd
import numpy as np
from datetime import datetime, timedelta

# Generate fake data for the transactions table
num_users = 50
user_ids = np.arange(1, num_users + 1)
product_ids = np.arange(1, 101)  # More product variety
start_date = datetime(2023, 1, 1)
end_date = datetime(2023, 12, 31)
date_range = pd.date_range(start_date, end_date)

# Create a list to store transactions
transactions = []
for user_id in user_ids:
    # Each user makes at least one purchase
    num_purchases = np.random.randint(1, 6)  # Users make 1 to 5 purchases
    purchase_dates = np.random.choice(date_range, size=num_purchases, replace=False)  # No duplicate dates for a user
    for date in purchase_dates:
        product_id = np.random.choice(product_ids)
        quantity = np.random.randint(1, 5)
        transactions.append([user_id, date, product_id, quantity])

df = pd.DataFrame(transactions, columns=['user_id', 'created_at', 'product_id', 'quantity'])

print(df.head())

   user_id created_at  product_id  quantity
0        1 2023-01-13          20         4
1        1 2023-12-24          47         3
2        1 2023-01-14           6         3
3        1 2023-07-13          34         2
4        1 2023-06-12          20         1

In [165]:
df['dense_rank'] = (df.groupby(['user_id'])['created_at'].rank(method='dense', ascending=True))
df['date'] = df['created_at'].dt.date  # Extract the date
df['date_rank'] = (df.groupby(['user_id', 'date'])['created_at']
                    .rank(method='dense', ascending=True))  # Rank by date too
upsell_users = df[(df['dense_rank'] > 1) & (df['date_rank'] == 1)].user_id.unique()
print(len(upsell_users))

43

In [1]:
import pandas as pd
import numpy as np

# Removing duplicates from a list with the same order of items

In [12]:
a= [4, 2, 5, 2, 3, 4, 1, 5, 3]

In [15]:
d = []
for item in a:
    if item not in d:
        d.append(item)
d

[4, 2, 5, 3, 1]

In [16]:
fruits = ['apple', 'banana', 'cherry']
for index, fruit in enumerate(fruits):
    print(fruit)

apple
banana
cherry

# Enumerate Usage

In [21]:
text = "hello"
for char in enumerate(text):
    print(char)

(0, 'h')
(1, 'e')
(2, 'l')
(3, 'l')
(4, 'o')

# FIGMA Interview Question

## We are investigating our ability to perform session analytics on a 1% sample:



## To test this, we would like to sub-sample our historic-dataset 1000 times in order to calculate the standard deviation we would expect from a random 1% sample:



## Given the dataframe below create a function that takes in a dataframe, the size of the subsample (in this case 1% of the total), and the number of subsamples (EX. running 1000 times) and returns the standard deviation for the means of each subsample.

## Dummy DataFrame

In [40]:
import pandas as pd
import numpy as np

# Set a random seed for reproducibility
np.random.seed(42)

# Define column names and generate data
data = {
    "ID": range(1, 101),  # Sequential IDs from 1 to 100
    "Name": [f"Person_{i}" for i in range(1, 101)],  # Random names
    "Age": np.random.randint(18, 60, size=100),  # Random ages between 18 and 60
    "Score": np.random.uniform(0, 100, size=100),  # Random scores between 0 and 100
    "City": np.random.choice(["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"], size=100),  # Random city
    "Signup_Date": pd.date_range(start="2023-01-01", periods=100, freq="D").to_series().sample(100).values  # Random signup dates
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the first 5 rows
df.head()

   ID      Name  Age      Score         City Signup_Date
0   1  Person_1   56  85.003858     New York  2023-03-13
1   2  Person_2   46  44.945067     New York  2023-03-31
2   3  Person_3   32   9.541012  Los Angeles  2023-01-11
3   4  Person_4   25  37.081825  Los Angeles  2023-03-20
4   5  Person_5   38  66.884125      Chicago  2023-04-02

# Solution

In [50]:
def sample_std (df,r,n):
    t=[]
    for i in range(0,n):
        s=df.sample(int(r*df.shape[0]*0.01))
        t.append(s)
    combined_df = pd.concat(t)
    print(combined_df['Score'].std())

# Random Sampling from a list

In [59]:
import random
random.sample(a,3)

[3, 3, 4]

# Slicing the list

In [60]:
my_list = [10, 20, 30, 40, 50]

# Get the first 3 elements:
print(my_list[0:3])  # Output: [10, 20, 30] 

# Get elements from index 2 to the end:
print(my_list[2:])   # Output: [30, 40, 50]

# Get every other element:
print(my_list[::2])  # Output: [10, 30, 50]

[10, 20, 30]
[30, 40, 50]
[10, 30, 50]

# Reverse the list:

In [61]:
print(my_list[::-1]) # Output: [50, 40, 30, 20, 10]

[50, 40, 30, 20, 10]

# Flatten a nested list in Python

## Generated by Gemini

In [62]:
def flatten(nested_list):
    return [item for sublist in nested_list for item in sublist]

nested_list = [[1, 2, 3], [4, 5], [6]]

flatten(nested_list)

[1, 2, 3, 4, 5, 6]

# Difference between "append" and "extend" in lists

In [67]:
my_list1 = [1, 2, 3]

my_list1.append(4)  # my_list becomes [1, 2, 3, 4]

my_list1.append([5, 6]) 

print(my_list1)

my_list2 = [1, 2, 3]

my_list2.extend([4, 5])  # my_list becomes [1, 2, 3, 4, 5]

my_list2.extend("abc")

print(my_list2)

[1, 2, 3, 4, [5, 6]]
[1, 2, 3, 4, 5, 'a', 'b', 'c']

# "zip" in Python

In [74]:
#List

names = ["Alice", "Bob", "Charlie"]
ages = [25, 30, 28]

zipped=zip(names, ages)
print(list(zipped))

# Dictionary

my_dict = dict(zip(names, ages))
print(my_dict)

[('Alice', 25), ('Bob', 30), ('Charlie', 28)]
{'Alice': 25, 'Bob': 30, 'Charlie': 28}

# Count of list of items in a "list"

In [85]:
l = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
f = {}
for item in l:
    if item in f:
        f[item] = f[item] + 1
    else:
        f[item] = 1
print(f)

{1: 1, 2: 2, 3: 3, 4: 4}

# "Itertools" Uses

In [90]:
from itertools import count

x=[]
for i in count(10, 3): 
    x.append(i)
    if i > 20:
        break
print(x)

[10, 13, 16, 19, 22]

# Appending lists

In [93]:
from itertools import chain

list1 = [1, 2, 3]
list2 = [4, 5]
for i in chain(list1, list2):
    print(i) 

list1 + list2

1
2
3
4
5

[1, 2, 3, 4, 5]

# Bi-Grams

In [98]:
from itertools import combinations
letters = ['a','b','c','d','e']
for combo in combinations(letters, 2):
    print(combo)

('a', 'b')
('a', 'c')
('a', 'd')
('a', 'e')
('b', 'c')
('b', 'd')
('b', 'e')
('c', 'd')
('c', 'e')
('d', 'e')

# Tri-Grams

In [99]:
letters = ['a','b','c','d','e']
for combo in combinations(letters, 3):
    print(combo)

('a', 'b', 'c')
('a', 'b', 'd')
('a', 'b', 'e')
('a', 'c', 'd')
('a', 'c', 'e')
('a', 'd', 'e')
('b', 'c', 'd')
('b', 'c', 'e')
('b', 'd', 'e')
('c', 'd', 'e')

# Recursion 

## Here's a breakdown of how to create a recursive function in Python:

1. Define the Base Case

The base case is the condition that stops the recursion. It's crucial to have a base case to prevent infinite loops. When the base case is met, the function returns a value without making further recursive calls.

2. Define the Recursive Case

The recursive case is where the function calls itself with a modified version of the input. This breaks the problem down into a smaller subproblem.

In [102]:
def factorial(n):
    if n == 0:
        return 1
    else:
        return n * factorial(n - 1) #Recursion
    
factorial(5)

120